#ifndef __histogram_h______________________
#define __histogram_h______________________

extern double x_histogram[100];
extern double interval;
extern int movingTimer; 
extern int moving_finished;

//===========================================================================
//	函数名称： setLocation(void);
//	作者：吴创		邮箱：3200102123@zju.edu.cn	联系电话：19883143610
// 	函数功能：	
//  最近修改：2020年6月1日 
//===========================================================================
//void setLocation(void);

//===========================================================================
//	函数名称： drawHistogram(void);
//	作者：刘逸洋	邮箱：3200104898@zju.edu.cn	联系电话：15757168776
// 	函数功能：	
//  最近修改：2020年6月1日 
//===========================================================================
void drawHistogram(void);

#endif // ifndef __histogram_h______________________

